zephyrproject-rtos/hal_microchip/mplabx/pic32cxsg/include/pic32cxsg41/component/tcc.h
#define TCC_EVCTRL_TCINV_Pos                  _UINT32_(12)                                         /* (TCC_EVCTRL Position) Inverted Event x Input Enable */
#define TCC_EVCTRL_TCINV_Msk                  (_UINT32_(0x3) << TCC_EVCTRL_TCINV_Pos)              /* (TCC_EVCTRL Mask) TCINV */
#define TCC_EVCTRL_TCINV(value)               (TCC_EVCTRL_TCINV_Msk & (_UINT32_(value) << TCC_EVCTRL_TCINV_Pos)) 
#define TCC_EVCTRL_TCEI_Pos                   _UINT32_(14)                                         /* (TCC_EVCTRL Position) Timer/counter Event x Input Enable */
#define TCC_EVCTRL_TCEI_Msk                   (_UINT32_(0x3) << TCC_EVCTRL_TCEI_Pos)               /* (TCC_EVCTRL Mask) TCEI */
#define TCC_EVCTRL_TCEI(value)                (TCC_EVCTRL_TCEI_Msk & (_UINT32_(value) << TCC_EVCTRL_TCEI_Pos)) 
#define TCC_EVCTRL_MCEI_Pos                   _UINT32_(16)                                         /* (TCC_EVCTRL Position) Match or Capture Channel x Event Input Enable */
#define TCC_EVCTRL_MCEI_Msk                   (_UINT32_(0x3F) << TCC_EVCTRL_MCEI_Pos)              /* (TCC_EVCTRL Mask) MCEI */
#define TCC_EVCTRL_MCEI(value)                (TCC_EVCTRL_MCEI_Msk & (_UINT32_(value) << TCC_EVCTRL_MCEI_Pos)) 
#define TCC_EVCTRL_MCEO_Pos                   _UINT32_(24)                                         /* (TCC_EVCTRL Position) Match or Capture Channel 5 Event Output Enable */
#define TCC_EVCTRL_MCEO_Msk                   (_UINT32_(0x3F) << TCC_EVCTRL_MCEO_Pos)              /* (TCC_EVCTRL Mask) MCEO */
#define TCC_EVCTRL_MCEO(value)                (TCC_EVCTRL_MCEO_Msk & (_UINT32_(value) << TCC_EVCTRL_MCEO_Pos)) 

/* -------- TCC_INTENCLR : (TCC Offset: 0x24) (R/W 32) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow Interrupt Enable          */
    uint32_t TRG:1;            /*!< bit:      1  Retrigger Interrupt Enable         */
    uint32_t CNT:1;            /*!< bit:      2  Counter Interrupt Enable           */
    uint32_t ERR:1;            /*!< bit:      3  Error Interrupt Enable             */
    uint32_t :6;               /*!< bit:  4.. 9  Reserved                           */
    uint32_t UFS:1;            /*!< bit:     10  Non-Recoverable Update Fault Interrupt Enable */
    uint32_t DFS:1;            /*!< bit:     11  Non-Recoverable Debug Fault Interrupt Enable */
    uint32_t FAULTA:1;         /*!< bit:     12  Recoverable Fault A Interrupt Enable */
    uint32_t FAULTB:1;         /*!< bit:     13  Recoverable Fault B Interrupt Enable */
    uint32_t FAULT0:1;         /*!< bit:     14  Non-Recoverable Fault 0 Interrupt Enable */
    uint32_t FAULT1:1;         /*!< bit:     15  Non-Recoverable Fault 1 Interrupt Enable */
    uint32_t MC0:1;            /*!< bit:     16  Match or Capture Channel 0 Interrupt Enable */
    uint32_t MC1:1;            /*!< bit:     17  Match or Capture Channel 1 Interrupt Enable */
    uint32_t MC2:1;            /*!< bit:     18  Match or Capture Channel 2 Interrupt Enable */
    uint32_t MC3:1;            /*!< bit:     19  Match or Capture Channel 3 Interrupt Enable */
    uint32_t MC4:1;            /*!< bit:     20  Match or Capture Channel 4 Interrupt Enable */
    uint32_t MC5:1;            /*!< bit:     21  Match or Capture Channel 5 Interrupt Enable */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  struct {
    uint32_t :16;              /*!< bit:  0..15  Reserved                           */
    uint32_t MC:6;             /*!< bit: 16..21  Match or Capture Channel x Interrupt Enable */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } vec;                       /*!< Structure used for vec  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TCC_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TCC_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (TCC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define TCC_INTENCLR_OVF_Pos                  _UINT32_(0)                                          /* (TCC_INTENCLR) Overflow Interrupt Enable Position */
#define TCC_INTENCLR_OVF_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_OVF_Pos)              /* (TCC_INTENCLR) Overflow Interrupt Enable Mask */
#define TCC_INTENCLR_OVF(value)               (TCC_INTENCLR_OVF_Msk & (_UINT32_(value) << TCC_INTENCLR_OVF_Pos)) /* Assigment of value for OVF in the TCC_INTENCLR register */
#define TCC_INTENCLR_TRG_Pos                  _UINT32_(1)                                          /* (TCC_INTENCLR) Retrigger Interrupt Enable Position */
#define TCC_INTENCLR_TRG_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_TRG_Pos)              /* (TCC_INTENCLR) Retrigger Interrupt Enable Mask */
#define TCC_INTENCLR_TRG(value)               (TCC_INTENCLR_TRG_Msk & (_UINT32_(value) << TCC_INTENCLR_TRG_Pos)) /* Assigment of value for TRG in the TCC_INTENCLR register */
#define TCC_INTENCLR_CNT_Pos                  _UINT32_(2)                                          /* (TCC_INTENCLR) Counter Interrupt Enable Position */
#define TCC_INTENCLR_CNT_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_CNT_Pos)              /* (TCC_INTENCLR) Counter Interrupt Enable Mask */
#define TCC_INTENCLR_CNT(value)               (TCC_INTENCLR_CNT_Msk & (_UINT32_(value) << TCC_INTENCLR_CNT_Pos)) /* Assigment of value for CNT in the TCC_INTENCLR register */
#define TCC_INTENCLR_ERR_Pos                  _UINT32_(3)                                          /* (TCC_INTENCLR) Error Interrupt Enable Position */
#define TCC_INTENCLR_ERR_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_ERR_Pos)              /* (TCC_INTENCLR) Error Interrupt Enable Mask */
#define TCC_INTENCLR_ERR(value)               (TCC_INTENCLR_ERR_Msk & (_UINT32_(value) << TCC_INTENCLR_ERR_Pos)) /* Assigment of value for ERR in the TCC_INTENCLR register */
#define TCC_INTENCLR_UFS_Pos                  _UINT32_(10)                                         /* (TCC_INTENCLR) Non-Recoverable Update Fault Interrupt Enable Position */
#define TCC_INTENCLR_UFS_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_UFS_Pos)              /* (TCC_INTENCLR) Non-Recoverable Update Fault Interrupt Enable Mask */
#define TCC_INTENCLR_UFS(value)               (TCC_INTENCLR_UFS_Msk & (_UINT32_(value) << TCC_INTENCLR_UFS_Pos)) /* Assigment of value for UFS in the TCC_INTENCLR register */
#define TCC_INTENCLR_DFS_Pos                  _UINT32_(11)                                         /* (TCC_INTENCLR) Non-Recoverable Debug Fault Interrupt Enable Position */
#define TCC_INTENCLR_DFS_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_DFS_Pos)              /* (TCC_INTENCLR) Non-Recoverable Debug Fault Interrupt Enable Mask */
#define TCC_INTENCLR_DFS(value)               (TCC_INTENCLR_DFS_Msk & (_UINT32_(value) << TCC_INTENCLR_DFS_Pos)) /* Assigment of value for DFS in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULTA_Pos               _UINT32_(12)                                         /* (TCC_INTENCLR) Recoverable Fault A Interrupt Enable Position */
#define TCC_INTENCLR_FAULTA_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULTA_Pos)           /* (TCC_INTENCLR) Recoverable Fault A Interrupt Enable Mask */
#define TCC_INTENCLR_FAULTA(value)            (TCC_INTENCLR_FAULTA_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULTA_Pos)) /* Assigment of value for FAULTA in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULTB_Pos               _UINT32_(13)                                         /* (TCC_INTENCLR) Recoverable Fault B Interrupt Enable Position */
#define TCC_INTENCLR_FAULTB_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULTB_Pos)           /* (TCC_INTENCLR) Recoverable Fault B Interrupt Enable Mask */
#define TCC_INTENCLR_FAULTB(value)            (TCC_INTENCLR_FAULTB_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULTB_Pos)) /* Assigment of value for FAULTB in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULT0_Pos               _UINT32_(14)                                         /* (TCC_INTENCLR) Non-Recoverable Fault 0 Interrupt Enable Position */
#define TCC_INTENCLR_FAULT0_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULT0_Pos)           /* (TCC_INTENCLR) Non-Recoverable Fault 0 Interrupt Enable Mask */
#define TCC_INTENCLR_FAULT0(value)            (TCC_INTENCLR_FAULT0_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT0_Pos)) /* Assigment of value for FAULT0 in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULT1_Pos               _UINT32_(15)                                         /* (TCC_INTENCLR) Non-Recoverable Fault 1 Interrupt Enable Position */
#define TCC_INTENCLR_FAULT1_Msk               (_UINT32_(0x1) << TCC_INTENCLR_FAULT1_Pos)           /* (TCC_INTENCLR) Non-Recoverable Fault 1 Interrupt Enable Mask */
#define TCC_INTENCLR_FAULT1(value)            (TCC_INTENCLR_FAULT1_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT1_Pos)) /* Assigment of value for FAULT1 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC0_Pos                  _UINT32_(16)                                         /* (TCC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Position */
#define TCC_INTENCLR_MC0_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC0_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Mask */
#define TCC_INTENCLR_MC0(value)               (TCC_INTENCLR_MC0_Msk & (_UINT32_(value) << TCC_INTENCLR_MC0_Pos)) /* Assigment of value for MC0 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC1_Pos                  _UINT32_(17)                                         /* (TCC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Position */
#define TCC_INTENCLR_MC1_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC1_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Mask */
#define TCC_INTENCLR_MC1(value)               (TCC_INTENCLR_MC1_Msk & (_UINT32_(value) << TCC_INTENCLR_MC1_Pos)) /* Assigment of value for MC1 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC2_Pos                  _UINT32_(18)                                         /* (TCC_INTENCLR) Match or Capture Channel 2 Interrupt Enable Position */
#define TCC_INTENCLR_MC2_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC2_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 2 Interrupt Enable Mask */
#define TCC_INTENCLR_MC2(value)               (TCC_INTENCLR_MC2_Msk & (_UINT32_(value) << TCC_INTENCLR_MC2_Pos)) /* Assigment of value for MC2 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC3_Pos                  _UINT32_(19)                                         /* (TCC_INTENCLR) Match or Capture Channel 3 Interrupt Enable Position */
#define TCC_INTENCLR_MC3_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC3_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 3 Interrupt Enable Mask */
#define TCC_INTENCLR_MC3(value)               (TCC_INTENCLR_MC3_Msk & (_UINT32_(value) << TCC_INTENCLR_MC3_Pos)) /* Assigment of value for MC3 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC4_Pos                  _UINT32_(20)                                         /* (TCC_INTENCLR) Match or Capture Channel 4 Interrupt Enable Position */
#define TCC_INTENCLR_MC4_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC4_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 4 Interrupt Enable Mask */
#define TCC_INTENCLR_MC4(value)               (TCC_INTENCLR_MC4_Msk & (_UINT32_(value) << TCC_INTENCLR_MC4_Pos)) /* Assigment of value for MC4 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC5_Pos                  _UINT32_(21)                                         /* (TCC_INTENCLR) Match or Capture Channel 5 Interrupt Enable Position */
#define TCC_INTENCLR_MC5_Msk                  (_UINT32_(0x1) << TCC_INTENCLR_MC5_Pos)              /* (TCC_INTENCLR) Match or Capture Channel 5 Interrupt Enable Mask */
#define TCC_INTENCLR_MC5(value)               (TCC_INTENCLR_MC5_Msk & (_UINT32_(value) << TCC_INTENCLR_MC5_Pos)) /* Assigment of value for MC5 in the TCC_INTENCLR register */
#define TCC_INTENCLR_Msk                      _UINT32_(0x003FFC0F)                                 /* (TCC_INTENCLR) Register Mask  */

#define TCC_INTENCLR_FAULT_Pos                _UINT32_(14)                                         /* (TCC_INTENCLR Position) Non-Recoverable Fault x Interrupt Enable */
#define TCC_INTENCLR_FAULT_Msk                (_UINT32_(0x3) << TCC_INTENCLR_FAULT_Pos)            /* (TCC_INTENCLR Mask) FAULT */
#define TCC_INTENCLR_FAULT(value)             (TCC_INTENCLR_FAULT_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT_Pos)) 
#define TCC_INTENCLR_MC_Pos                   _UINT32_(16)                                         /* (TCC_INTENCLR Position) Match or Capture Channel 5 Interrupt Enable */
#define TCC_INTENCLR_MC_Msk                   (_UINT32_(0x3F) << TCC_INTENCLR_MC_Pos)              /* (TCC_INTENCLR Mask) MC */
#define TCC_INTENCLR_MC(value)                (TCC_INTENCLR_MC_Msk & (_UINT32_(value) << TCC_INTENCLR_MC_Pos)) 

/* -------- TCC_INTENSET : (TCC Offset: 0x28) (R/W 32) Interrupt Enable Set -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OVF:1;            /*!< bit:      0  Overflow Interrupt Enable          */
    uint32_t TRG:1;            /*!< bit:      1  Retrigger Interrupt Enable         */
    uint32_t CNT:1;            /*!< bit:      2  Counter Interrupt Enable           */
    uint32_t ERR:1;            /*!< bit:      3  Error Interrupt Enable             */
    uint32_t :6;               /*!< bit:  4.. 9  Reserved                           */
    uint32_t UFS:1;            /*!< bit:     10  Non-Recoverable Update Fault Interrupt Enable */
    uint32_t DFS:1;            /*!< bit:     11  Non-Recoverable Debug Fault Interrupt Enable */
    uint32_t FAULTA:1;         /*!< bit:     12  Recoverable Fault A Interrupt Enable */
    uint32_t FAULTB:1;         /*!< bit:     13  Recoverable Fault B Interrupt Enable */
    uint32_t FAULT0:1;         /*!< bit:     14  Non-Recoverable Fault 0 Interrupt Enable */
    uint32_t FAULT1:1;         /*!< bit:     15  Non-Recoverable Fault 1 Interrupt Enable */
    uint32_t MC0:1;            /*!< bit:     16  Match or Capture Channel 0 Interrupt Enable */
    uint32_t MC1:1;            /*!< bit:     17  Match or Capture Channel 1 Interrupt Enable */
    uint32_t MC2:1;            /*!< bit:     18  Match or Capture Channel 2 Interrupt Enable */
    uint32_t MC3:1;            /*!< bit:     19  Match or Capture Channel 3 Interrupt Enable */
    uint32_t MC4:1;            /*!< bit:     20  Match or Capture Channel 4 Interrupt Enable */
    uint32_t MC5:1;            /*!< bit:     21  Match or Capture Channel 5 Interrupt Enable */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  struct {
    uint32_t :16;              /*!< bit:  0..15  Reserved                           */
    uint32_t MC:6;             /*!< bit: 16..21  Match or Capture Channel x Interrupt Enable */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } vec;                       /*!< Structure used for vec  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TCC_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TCC_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (TCC_INTENSET) Interrupt Enable Set  Reset Value */

