zephyrproject-rtos/hal_microchip/mplabx/pic32cxsg/include/pic32cxsg41/component/tcc.h
#define TCC_INTENSET_OVF_Pos                  _UINT32_(0)                                          /* (TCC_INTENSET) Overflow Interrupt Enable Position */
#define TCC_INTENSET_OVF_Msk                  (_UINT32_(0x1) << TCC_INTENSET_OVF_Pos)              /* (TCC_INTENSET) Overflow Interrupt Enable Mask */
#define TCC_INTENSET_OVF(value)               (TCC_INTENSET_OVF_Msk & (_UINT32_(value) << TCC_INTENSET_OVF_Pos)) /* Assigment of value for OVF in the TCC_INTENSET register */
#define TCC_INTENSET_TRG_Pos                  _UINT32_(1)                                          /* (TCC_INTENSET) Retrigger Interrupt Enable Position */
#define TCC_INTENSET_TRG_Msk                  (_UINT32_(0x1) << TCC_INTENSET_TRG_Pos)              /* (TCC_INTENSET) Retrigger Interrupt Enable Mask */
#define TCC_INTENSET_TRG(value)               (TCC_INTENSET_TRG_Msk & (_UINT32_(value) << TCC_INTENSET_TRG_Pos)) /* Assigment of value for TRG in the TCC_INTENSET register */
#define TCC_INTENSET_CNT_Pos                  _UINT32_(2)                                          /* (TCC_INTENSET) Counter Interrupt Enable Position */
#define TCC_INTENSET_CNT_Msk                  (_UINT32_(0x1) << TCC_INTENSET_CNT_Pos)              /* (TCC_INTENSET) Counter Interrupt Enable Mask */
#define TCC_INTENSET_CNT(value)               (TCC_INTENSET_CNT_Msk & (_UINT32_(value) << TCC_INTENSET_CNT_Pos)) /* Assigment of value for CNT in the TCC_INTENSET register */
#define TCC_INTENSET_ERR_Pos                  _UINT32_(3)                                          /* (TCC_INTENSET) Error Interrupt Enable Position */
#define TCC_INTENSET_ERR_Msk                  (_UINT32_(0x1) << TCC_INTENSET_ERR_Pos)              /* (TCC_INTENSET) Error Interrupt Enable Mask */
#define TCC_INTENSET_ERR(value)               (TCC_INTENSET_ERR_Msk & (_UINT32_(value) << TCC_INTENSET_ERR_Pos)) /* Assigment of value for ERR in the TCC_INTENSET register */
#define TCC_INTENSET_UFS_Pos                  _UINT32_(10)                                         /* (TCC_INTENSET) Non-Recoverable Update Fault Interrupt Enable Position */
#define TCC_INTENSET_UFS_Msk                  (_UINT32_(0x1) << TCC_INTENSET_UFS_Pos)              /* (TCC_INTENSET) Non-Recoverable Update Fault Interrupt Enable Mask */
#define TCC_INTENSET_UFS(value)               (TCC_INTENSET_UFS_Msk & (_UINT32_(value) << TCC_INTENSET_UFS_Pos)) /* Assigment of value for UFS in the TCC_INTENSET register */
#define TCC_INTENSET_DFS_Pos                  _UINT32_(11)                                         /* (TCC_INTENSET) Non-Recoverable Debug Fault Interrupt Enable Position */
#define TCC_INTENSET_DFS_Msk                  (_UINT32_(0x1) << TCC_INTENSET_DFS_Pos)              /* (TCC_INTENSET) Non-Recoverable Debug Fault Interrupt Enable Mask */
#define TCC_INTENSET_DFS(value)               (TCC_INTENSET_DFS_Msk & (_UINT32_(value) << TCC_INTENSET_DFS_Pos)) /* Assigment of value for DFS in the TCC_INTENSET register */
#define TCC_INTENSET_FAULTA_Pos               _UINT32_(12)                                         /* (TCC_INTENSET) Recoverable Fault A Interrupt Enable Position */
#define TCC_INTENSET_FAULTA_Msk               (_UINT32_(0x1) << TCC_INTENSET_FAULTA_Pos)           /* (TCC_INTENSET) Recoverable Fault A Interrupt Enable Mask */
#define TCC_INTENSET_FAULTA(value)            (TCC_INTENSET_FAULTA_Msk & (_UINT32_(value) << TCC_INTENSET_FAULTA_Pos)) /* Assigment of value for FAULTA in the TCC_INTENSET register */
#define TCC_INTENSET_FAULTB_Pos               _UINT32_(13)                                         /* (TCC_INTENSET) Recoverable Fault B Interrupt Enable Position */
#define TCC_INTENSET_FAULTB_Msk               (_UINT32_(0x1) << TCC_INTENSET_FAULTB_Pos)           /* (TCC_INTENSET) Recoverable Fault B Interrupt Enable Mask */
#define TCC_INTENSET_FAULTB(value)            (TCC_INTENSET_FAULTB_Msk & (_UINT32_(value) << TCC_INTENSET_FAULTB_Pos)) /* Assigment of value for FAULTB in the TCC_INTENSET register */
#define TCC_INTENSET_FAULT0_Pos               _UINT32_(14)                                         /* (TCC_INTENSET) Non-Recoverable Fault 0 Interrupt Enable Position */
#define TCC_INTENSET_FAULT0_Msk               (_UINT32_(0x1) << TCC_INTENSET_FAULT0_Pos)           /* (TCC_INTENSET) Non-Recoverable Fault 0 Interrupt Enable Mask */
#define TCC_INTENSET_FAULT0(value)            (TCC_INTENSET_FAULT0_Msk & (_UINT32_(value) << TCC_INTENSET_FAULT0_Pos)) /* Assigment of value for FAULT0 in the TCC_INTENSET register */
#define TCC_INTENSET_FAULT1_Pos               _UINT32_(15)                                         /* (TCC_INTENSET) Non-Recoverable Fault 1 Interrupt Enable Position */
#define TCC_INTENSET_FAULT1_Msk               (_UINT32_(0x1) << TCC_INTENSET_FAULT1_Pos)           /* (TCC_INTENSET) Non-Recoverable Fault 1 Interrupt Enable Mask */
#define TCC_INTENSET_FAULT1(value)            (TCC_INTENSET_FAULT1_Msk & (_UINT32_(value) << TCC_INTENSET_FAULT1_Pos)) /* Assigment of value for FAULT1 in the TCC_INTENSET register */
#define TCC_INTENSET_MC0_Pos                  _UINT32_(16)                                         /* (TCC_INTENSET) Match or Capture Channel 0 Interrupt Enable Position */
#define TCC_INTENSET_MC0_Msk                  (_UINT32_(0x1) << TCC_INTENSET_MC0_Pos)              /* (TCC_INTENSET) Match or Capture Channel 0 Interrupt Enable Mask */
#define TCC_INTENSET_MC0(value)               (TCC_INTENSET_MC0_Msk & (_UINT32_(value) << TCC_INTENSET_MC0_Pos)) /* Assigment of value for MC0 in the TCC_INTENSET register */
#define TCC_INTENSET_MC1_Pos                  _UINT32_(17)                                         /* (TCC_INTENSET) Match or Capture Channel 1 Interrupt Enable Position */
#define TCC_INTENSET_MC1_Msk                  (_UINT32_(0x1) << TCC_INTENSET_MC1_Pos)              /* (TCC_INTENSET) Match or Capture Channel 1 Interrupt Enable Mask */
#define TCC_INTENSET_MC1(value)               (TCC_INTENSET_MC1_Msk & (_UINT32_(value) << TCC_INTENSET_MC1_Pos)) /* Assigment of value for MC1 in the TCC_INTENSET register */
#define TCC_INTENSET_MC2_Pos                  _UINT32_(18)                                         /* (TCC_INTENSET) Match or Capture Channel 2 Interrupt Enable Position */
#define TCC_INTENSET_MC2_Msk                  (_UINT32_(0x1) << TCC_INTENSET_MC2_Pos)              /* (TCC_INTENSET) Match or Capture Channel 2 Interrupt Enable Mask */
#define TCC_INTENSET_MC2(value)               (TCC_INTENSET_MC2_Msk & (_UINT32_(value) << TCC_INTENSET_MC2_Pos)) /* Assigment of value for MC2 in the TCC_INTENSET register */
#define TCC_INTENSET_MC3_Pos                  _UINT32_(19)                                         /* (TCC_INTENSET) Match or Capture Channel 3 Interrupt Enable Position */
#define TCC_INTENSET_MC3_Msk                  (_UINT32_(0x1) << TCC_INTENSET_MC3_Pos)              /* (TCC_INTENSET) Match or Capture Channel 3 Interrupt Enable Mask */
#define TCC_INTENSET_MC3(value)               (TCC_INTENSET_MC3_Msk & (_UINT32_(value) << TCC_INTENSET_MC3_Pos)) /* Assigment of value for MC3 in the TCC_INTENSET register */
#define TCC_INTENSET_MC4_Pos                  _UINT32_(20)                                         /* (TCC_INTENSET) Match or Capture Channel 4 Interrupt Enable Position */
#define TCC_INTENSET_MC4_Msk                  (_UINT32_(0x1) << TCC_INTENSET_MC4_Pos)              /* (TCC_INTENSET) Match or Capture Channel 4 Interrupt Enable Mask */
#define TCC_INTENSET_MC4(value)               (TCC_INTENSET_MC4_Msk & (_UINT32_(value) << TCC_INTENSET_MC4_Pos)) /* Assigment of value for MC4 in the TCC_INTENSET register */
#define TCC_INTENSET_MC5_Pos                  _UINT32_(21)                                         /* (TCC_INTENSET) Match or Capture Channel 5 Interrupt Enable Position */
#define TCC_INTENSET_MC5_Msk                  (_UINT32_(0x1) << TCC_INTENSET_MC5_Pos)              /* (TCC_INTENSET) Match or Capture Channel 5 Interrupt Enable Mask */
#define TCC_INTENSET_MC5(value)               (TCC_INTENSET_MC5_Msk & (_UINT32_(value) << TCC_INTENSET_MC5_Pos)) /* Assigment of value for MC5 in the TCC_INTENSET register */
#define TCC_INTENSET_Msk                      _UINT32_(0x003FFC0F)                                 /* (TCC_INTENSET) Register Mask  */

#define TCC_INTENSET_FAULT_Pos                _UINT32_(14)                                         /* (TCC_INTENSET Position) Non-Recoverable Fault x Interrupt Enable */
#define TCC_INTENSET_FAULT_Msk                (_UINT32_(0x3) << TCC_INTENSET_FAULT_Pos)            /* (TCC_INTENSET Mask) FAULT */
#define TCC_INTENSET_FAULT(value)             (TCC_INTENSET_FAULT_Msk & (_UINT32_(value) << TCC_INTENSET_FAULT_Pos)) 
#define TCC_INTENSET_MC_Pos                   _UINT32_(16)                                         /* (TCC_INTENSET Position) Match or Capture Channel 5 Interrupt Enable */
#define TCC_INTENSET_MC_Msk                   (_UINT32_(0x3F) << TCC_INTENSET_MC_Pos)              /* (TCC_INTENSET Mask) MC */
#define TCC_INTENSET_MC(value)                (TCC_INTENSET_MC_Msk & (_UINT32_(value) << TCC_INTENSET_MC_Pos)) 

/* -------- TCC_INTFLAG : (TCC Offset: 0x2C) (R/W 32) Interrupt Flag Status and Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { // __I to avoid read-modify-write on write-to-clear register
  struct {
    __I uint32_t OVF:1;            /*!< bit:      0  Overflow                           */
    __I uint32_t TRG:1;            /*!< bit:      1  Retrigger                          */
    __I uint32_t CNT:1;            /*!< bit:      2  Counter                            */
    __I uint32_t ERR:1;            /*!< bit:      3  Error                              */
    __I uint32_t :6;               /*!< bit:  4.. 9  Reserved                           */
    __I uint32_t UFS:1;            /*!< bit:     10  Non-Recoverable Update Fault       */
    __I uint32_t DFS:1;            /*!< bit:     11  Non-Recoverable Debug Fault        */
    __I uint32_t FAULTA:1;         /*!< bit:     12  Recoverable Fault A                */
    __I uint32_t FAULTB:1;         /*!< bit:     13  Recoverable Fault B                */
    __I uint32_t FAULT0:1;         /*!< bit:     14  Non-Recoverable Fault 0            */
    __I uint32_t FAULT1:1;         /*!< bit:     15  Non-Recoverable Fault 1            */
    __I uint32_t MC0:1;            /*!< bit:     16  Match or Capture 0                 */
    __I uint32_t MC1:1;            /*!< bit:     17  Match or Capture 1                 */
    __I uint32_t MC2:1;            /*!< bit:     18  Match or Capture 2                 */
    __I uint32_t MC3:1;            /*!< bit:     19  Match or Capture 3                 */
    __I uint32_t MC4:1;            /*!< bit:     20  Match or Capture 4                 */
    __I uint32_t MC5:1;            /*!< bit:     21  Match or Capture 5                 */
    __I uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  struct {
    __I uint32_t :16;              /*!< bit:  0..15  Reserved                           */
    __I uint32_t MC:6;             /*!< bit: 16..21  Match or Capture x                 */
    __I uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } vec;                       /*!< Structure used for vec  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TCC_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

